#include "Junction.hpp"

/*
Представя ребро в граф. Пази указател към началото и края на улицата, за да можем да се движим по графа, както и разстоянието.
Не се грижи за менижирането на паметта, сочена от begin и end. Цялата отговорност по това се оставя на класът Map, тъй като Street 
абстрактно е част от дефиницията на Map. Причината тази структура да не се намира в private частта на Map е за да може да се използва малко
по-удобно в рамките на проекта и да има разделение на логическите единици.
*/
struct Street
{
    Junction *begin;
    Junction *end;
    double distance;
};